def area(a, b): 
    '''
    Возвращает площадь прямоугольника

        Параметры:
            a (int) : целое положительное число(ширина прямоугольника)
            b (int) : целое положительное число(длина прямоугольника)
        
        Возвращаемое значение:
            area (int) : целое положительное число(площадь прямоугольника)
    '''
    return a * b 

def perimeter(a, b): 
    '''
    Возвращает периметр прямоугольника

        Параметры:
            a (int) : целое положительное число(ширина прямоугольника)
            b (int) : целое положительное число(длина прямоугольника)
        
        Возвращаемое значение:
            perimeter (int) : целое положительное число(периметр прямоугольника)
    '''
    return (a + b ) * 2