def area(a):
    '''
    Возвращает площадь квадрата

        Параметры:
            a (int) : целое положительное число(сторона квадрата)
        
        Возвращаемое значение:
            area (int) : целое положительное число(площадь квадрата)
    '''
    return a * a


def perimeter(a):
    '''
    Возвращает периметр квадрата

        Параметры:
            a (int) : целое положительное число(сторона квадрата)
        
        Возвращаемое значение:
            perimeter (int) : целое положительное число(периметр квадрата)
    '''
    return 4 * a